
/*------------------------------------------------------------------*/
/* --- STC MCU International Limited -------------------------------*/
/* --- STC 1T Series MCU RC Demo -----------------------------------*/
/* --- Mobile: (86)13922805190 -------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ---------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ---------------------*/
/* --- Web: www.GXWMCU.com -----------------------------------------*/
/* --- QQ:  800003751 ----------------------------------------------*/
/* If you want to use the program or the program referenced in the  */
/* article, please specify in which data and procedures from STC    */
/*------------------------------------------------------------------*/


/*************	功能说明	**************

本文件为STC15xxx系列的延时程序,用户几乎可以不修改这个程序.


******************************************/

#include	"delay.h"
#include "stc15.h"


//========================================================================
// 函数: void  delay_ms(unsigned char ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~255ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2013-4-1
// 备注: 
//========================================================================
void delay_ms(unsigned int ms)
{
	unsigned char i, j;
	do {
		_nop_();
		_nop_();
		i = 33;
		j = 66;
		do {
			while (--j);
		} while (--i);
  } while(--ms);
}

//void delay_us(unsigned int us)
//{
//	unsigned char i;
//	us >>= 1;
//	while(us--) {
//		_nop_();
//		_nop_();
//		_nop_();
//		i = 5;
//		while (--i);
//	}
//}

void delay_us(unsigned int us)
{
	for(;;) {
		NOP(22);
		if (--us == 0)
			return;
	}
}

